IDENTIFICATION DIVISION.
PROGRAM-ID. PAYSLIP-GENERATOR.

 ENVIRONMENT DIVISION.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
    SELECT EMPLOYEE-FILE ASSIGN TO 'data/employees.dat'
         ORGANIZATION IS LINE SEQUENTIAL.
    SELECT PAYSLIP-FILE ASSIGN TO 'data/payslip.txt'
         SELECT PAYSLIP-FILE ASSIGN TO 'data/payslip.txt'